zeranemesis/Marioparty4/partyboard/src/REL/m408Dll/main.c
        case 2:
            if ((work->unk78 & 0xF) == 0) {
                float temp_f30 = (0.04f * frandmod(1000)) - 20.0f;
                float temp_f29 = (0.04f * frandmod(1000)) - 20.0f;
                work->unk84[1] = temp_f31 = atan2d(temp_f30 - work->unk1C.x, temp_f29 - work->unk1C.z);
            }
            work->unk78++;
            work->unk84[0] = fn_1_883C(work->unk84[0], work->unk84[1], 0.2f);
            work->unk7C[0] = sind(work->unk84[0]) * 80.0;
            work->unk7C[1] = -cosd(work->unk84[0]) * 80.0;
            *arg1 = work->unk7C[0];
            *arg2 = work->unk7C[1];
            if (temp_r29 > 0 || temp_r25) {
                work->unk8E = 0;
            }
            break;
    }
}

#define CHECK_IDLE(pos) (((pos) < 0) ? -(pos) : ((pos) > 15))

void fn_1_4A58(omObjData *object);
void fn_1_5098(omObjData *object);
void fn_1_5684(omObjData *object);

void fn_1_3E80(omObjData *object)
{
    Work2FAC *temp_r31;
    s32 temp_r27;

    float temp_f29;
    float temp_f28;
    float temp_f22;
    float temp_f21;
    float temp_f20;
    s8 sp9;
    s8 sp8;

    temp_r31 = object->data;
    temp_r27 = GWPlayerCfg[temp_r31->unk0].pad_idx;
    sp9 = sp8 = 0;
    if (lbl_1_bss_60 == 3) {
        if (!GWPlayerCfg[temp_r31->unk0].iscom) {
            sp9 = HuPadStkX[temp_r27];
            sp8 = HuPadStkY[temp_r27];
        }
        else {
            fn_1_38D0(object, &sp9, &sp8);
        }
    }
    temp_r31->unk1C.y = lbl_1_bss_54;
    temp_f21 = temp_f20 = 0;
    temp_f28 = temp_r31->unk58.x;
    temp_f22 = -20;
    if (CHECK_IDLE(sp9) || CHECK_IDLE(sp8)) {
        temp_f28 = atan2d(sp9, -sp8);
        if (temp_f28 < 0) {
            temp_f28 += 360;
        }
        temp_f21 = 70 * sind(temp_f28);
        temp_f20 = 70 * cosd(temp_f28);
        temp_f22 = 30;
    }
    fn_1_1EBC(object);
#if VERSION_PAL
#define _VAL_1 (23.0f / 25.0f)
#define _VAL_2 (2.0f / 25.0f)
#else
#define _VAL_1 (28.0f / 30.0f)
#define _VAL_2 (2.0f / 30.0f)
#endif
    temp_r31->unk28.x = (_VAL_1 * temp_r31->unk28.x) + (_VAL_2 * temp_f21);
    temp_r31->unk28.z = (_VAL_1 * temp_r31->unk28.z) + (_VAL_2 * temp_f20);
#undef _VAL_1
#undef _VAL_2
    temp_f29 = VECMagXZ(&temp_r31->unk28);
    if (temp_f29 > 200.0f) {
        temp_f29 = 200.0f / temp_f29;
        temp_r31->unk28.x *= temp_f29;
        temp_r31->unk28.z *= temp_f29;
    }
    temp_r31->unk34.x += (temp_r31->unk28.x * REFRESH_FREQ);
    temp_r31->unk34.y = 0;
    temp_r31->unk34.z += (temp_r31->unk28.z * REFRESH_FREQ);
    temp_r31->unk58.x = temp_f28;
    temp_r31->unk58.y = (0.9f * temp_r31->unk58.y) + (0.1f * temp_f22);
    temp_r31->unk4C.x = temp_r31->unk58.y;
    temp_r31->unk4C.y = fn_1_883C(temp_r31->unk4C.y, temp_r31->unk58.x, 0.2f);
    temp_r31->unk4C.z = 0;
    omSetRot(object, temp_r31->unk4C.x, temp_r31->unk4C.y, temp_r31->unk4C.z);
    fn_1_1940(temp_r31, &temp_r31->unk68);
    omSetTra(object, temp_r31->unk1C.x + temp_r31->unk68.x, temp_r31->unk1C.y + temp_r31->unk68.y, temp_r31->unk1C.z + temp_r31->unk68.z);
    temp_r31->unkC += (1.0f - temp_r31->unkC) * 0.2f;
    fn_1_1BE8(object, 0.3f);
    if (temp_r31->unk4 & 0x1) {
        temp_r31->unk8--;
        temp_r31->unk10 = 0;
        temp_r31->unk4 |= 2;
        temp_f29 = VECMagXZ(&temp_r31->unk40);
        if (temp_f29 > 0.0f) {
            temp_f29 = 150.0f / temp_f29;
        }
        temp_r31->unk28.x = temp_r31->unk40.x * temp_f29;
        temp_r31->unk28.z = temp_r31->unk40.z * temp_f29;
        temp_r31->unk34.x = temp_r31->unk28.x * REFRESH_FREQ;
        temp_r31->unk34.z = temp_r31->unk28.z * REFRESH_FREQ;
        CharMotionShiftSet(temp_r31->unk2, object->motion[5], 0, 0.2f, HU3D_MOTATTR_NONE);
        HuAudFXPlay(1358);
        omVibrate(object->work[0], 12, 4, 2);
        if (temp_r31->unk8) {
            CharFXPlay(temp_r31->unk2, 296);
            object->func = fn_1_4A58;
        }
        else {
            temp_r31->unk4 |= 0x30;
            lbl_1_bss_4C--;
            CharFXPlay(temp_r31->unk2, 291);
            object->func = fn_1_5684;
        }
    }
    if (fn_1_6878() == 4 && (temp_r31->unk4 & 0x20) == 0) {
        CharMotionShiftSet(temp_r31->unk2, object->motion[3], 0, 0.2f, HU3D_MOTATTR_NONE);
        Hu3DModelShadowSet(object->model[0]);
        object->work[1] = 0;
        object->func = fn_1_5098;
    }
}
#undef CHECK_IDLE

void fn_1_4A58(omObjData *object)
{
    s32 temp_r28;
    s32 temp_r26;
    Work2FAC *temp_r31 = object->data;
    s32 sp8 = temp_r31->unk0;
    temp_r31->unk4 |= 2;
    temp_r31->unk1C.y = lbl_1_bss_54;
    fn_1_1EBC(object);
#if VERSION_PAL
    temp_r31->unk28.x = (24.0f / 25.0f) * temp_r31->unk28.x;
    temp_r31->unk28.z = (24.0f / 25.0f) * temp_r31->unk28.z;
#else
    temp_r31->unk28.x = (29.0f / 30.0f) * temp_r31->unk28.x;
    temp_r31->unk28.z = (29.0f / 30.0f) * temp_r31->unk28.z;
#endif
    temp_r31->unk34.x += temp_r31->unk28.x * REFRESH_FREQ;
    temp_r31->unk34.y = 0;
    temp_r31->unk34.z += temp_r31->unk28.z * REFRESH_FREQ;

#if VERSION_PAL
    temp_r31->unk58.x += 10.8f;
#else
    temp_r31->unk58.x += 9.0f;
#endif
    if (temp_r31->unk58.x >= 360.0f) {
        temp_r31->unk58.x -= 360.0f;
    }
    temp_r31->unk58.y = 0.9f * temp_r31->unk58.y;
    temp_r31->unk4C.x = temp_r31->unk58.y;
    temp_r31->unk4C.y = temp_r31->unk58.x;
    temp_r31->unk4C.z = 0;
    omSetRot(object, temp_r31->unk4C.x, temp_r31->unk4C.y, temp_r31->unk4C.z);
    fn_1_1940(temp_r31, &temp_r31->unk68);
    omSetTra(object, temp_r31->unk1C.x + temp_r31->unk68.x, temp_r31->unk1C.y + temp_r31->unk68.y, temp_r31->unk1C.z + temp_r31->unk68.z);
    fn_1_1BE8(object, 0.8f);
    temp_r26 = temp_r31->unk10 & 0x1;
    temp_r31->unk10++;
    if (fn_1_6878() == 4) {
        temp_r26 = 0;
        CharMotionShiftSet(temp_r31->unk2, object->motion[3], 0, 0.2f, HU3D_MOTATTR_NONE);
        Hu3DModelShadowSet(object->model[0]);
        object->work[1] = 0;
        object->func = fn_1_5098;
    }
    else if (temp_r31->unk10 > REFRESH_RATE) {
        temp_r26 = 0;
        temp_r31->unk4 &= ~0x3;
        CharMotionShiftSet(temp_r31->unk2, object->motion[4], 0, 0.2f, HU3D_MOTATTR_LOOP);
        object->func = fn_1_3E80;
    }
    if (temp_r26) {
        Hu3DModelAttrSet(object->model[0], HU3D_ATTR_DISPOFF);
        for (temp_r28 = 0; temp_r28 < temp_r31->unk8; temp_r28++) {
            Hu3DModelAttrSet(object->model[1], HU3D_ATTR_DISPOFF);
        }
    }
    else {
        Hu3DModelAttrReset(object->model[0], HU3D_ATTR_DISPOFF);
        for (temp_r28 = 0; temp_r28 < temp_r31->unk8; temp_r28++) {
            Hu3DModelAttrReset(object->model[1], HU3D_ATTR_DISPOFF);
        }
    }
}

Vec lbl_1_data_144[] = { { -50, 0, 0 }, { -16, 0, 0 }, { 16, 0, 0 }, { 50, 0, 0 } };

Vec lbl_1_data_174[] = { { 0, 1500, 2500 }, { 1500, 0, 1 }, { 0, 0, 0 } };

void fn_1_54E4(omObjData *object);

void fn_1_5098(omObjData *object)
{
    Work2FAC *work = object->data;
    object->trans.x = lbl_1_data_144[object->work[0]].x;
    object->trans.z = lbl_1_data_144[object->work[0]].z;
    if (object->work[1] == 0) {
        if (lbl_1_bss_3C < work->unk8) {
            lbl_1_bss_3C = work->unk8;
        }
    }
    else if (object->work[1] == 10 && lbl_1_bss_3C == work->unk8) {
        s32 temp_r27;
        for (temp_r27 = 0; lbl_1_bss_28[temp_r27] >= 0; temp_r27++)
            ;
        lbl_1_bss_28[temp_r27] = work->unk2;
    }
    object->work[1]++;
    work->unk1C.y = lbl_1_bss_54;
    work->unk58.y = 0;
    work->unk58.x = 0;
    object->rot.x = object->rot.y = object->rot.z = 0;
    object->trans.y = work->unk1C.y;
    work->unk1C.x = object->trans.x;
    work->unk1C.z = object->trans.z;
    work->unk1C.y += lbl_1_data_A0[work->unk2];
    if (object->trans.y < 0) {
        object->trans.y = 0;
    }
    fn_1_1BE8(object, 1.0f);
    if (fn_1_6878() == 5) {
        object->func = fn_1_54E4;
        if (work->unk14) {
            lbl_1_bss_C = 1;
        }
    }
}

void fn_1_54E4(omObjData *object)
{
    Work2FAC *temp_r30 = object->data;
    fn_1_1E54(object);
    if (!(temp_r30->unk4 & 0x8)) {
        temp_r30->unk4 |= 0x8;
        if (temp_r30->unk14 != 0) {
            CharMotionShiftSet(temp_r30->unk2, object->motion[1], 0, 0.2f, HU3D_MOTATTR_NONE);
            CharFXPlay(temp_r30->unk2, 290);
            GWPlayerCoinCollectAdd(object->work[0], temp_r30->unk14);
        }
        else {
            CharMotionShiftSet(temp_r30->unk2, object->motion[2], 0, 0.2f, HU3D_MOTATTR_NONE);
        }
        object->work[1] = 0;
    }
    else if (object->work[1] == 0 && Hu3DMotionEndCheck(object->model[0])) {
        lbl_1_bss_4C--;
        object->work[1]++;
    }
}

void fn_1_5AA0(omObjData *object);

void fn_1_5684(omObjData *object)
{
    Work2FAC *temp_r31 = object->data;
    if (fabs(object->trans.x) < 160.0 || fabs(object->trans.z) < 160.0) {
        temp_r31->unk1C.x += temp_r31->unk28.x * REFRESH_FREQ;
        temp_r31->unk1C.z += temp_r31->unk28.z * REFRESH_FREQ;
#if VERSION_PAL
        temp_r31->unk58.x += 10.8f;
#else
        temp_r31->unk58.x += 9.0f;
#endif
        if (temp_r31->unk58.x >= 360.0f) {
            temp_r31->unk58.x -= 360.0f;
        }
        temp_r31->unk58.y = 0.9f * temp_r31->unk58.y;
        temp_r31->unk4C.x = 90.0f + temp_r31->unk58.y;
        temp_r31->unk4C.y = temp_r31->unk58.x;
        temp_r31->unk4C.z = 0;
        omSetRot(object, temp_r31->unk4C.x, temp_r31->unk4C.y, temp_r31->unk4C.z);
        fn_1_1940(temp_r31, &temp_r31->unk68);
        omSetTra(object, temp_r31->unk1C.x + temp_r31->unk68.x, temp_r31->unk1C.y + temp_r31->unk68.y, temp_r31->unk1C.z + temp_r31->unk68.z);
    }
    if (fn_1_6878() >= 4) {
        s32 temp_r29;
        GWPlayerCoinCollectAdd(object->work[0], temp_r31->unk14);
        if (lbl_1_bss_48) {
            Hu3DModelAttrReset(object->model[0], HU3D_ATTR_DISPOFF);
            CharMotionSet(temp_r31->unk2, object->motion[6]);
            Hu3DModelAttrSet(object->model[0], HU3D_MOTATTR_LOOP);
            object->trans.x = lbl_1_data_144[object->work[0]].x;
            object->trans.y = 0;
            object->trans.z = lbl_1_data_144[object->work[0]].z;
            object->rot.x = object->rot.y = object->rot.z = 0;
        }
        else {
            Hu3DModelAttrSet(object->model[0], HU3D_ATTR_DISPOFF);
        }

        for (temp_r29 = 0; temp_r29 < 4; temp_r29++) {
            Hu3DModelAttrSet(object->model[1], HU3D_ATTR_DISPOFF);
        }
        object->func = fn_1_5AA0;
    }
}

void fn_1_5AA0(omObjData *object)
{
    Work2FAC *sp8 = object->data;
}

