zeranemesis/Marioparty4/partyboard/src/REL/m408Dll/main.c
void fn_1_5AB4(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    HU3DPARTICLEDATA *temp_r31;
    s32 temp_r29;
    float temp_f31;
    if (particle->dataCnt == 0) {
        particle->dataCnt++;
        temp_r31 = particle->data;
        for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
            temp_r31->time = 0;
            temp_r31->scale = 0;
            temp_r31->color.a = 0;
        }
        return;
    }
    temp_r31 = particle->data;
    for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
        if (temp_r31->time == 0 || temp_r31->time != 1) {
            continue;
        }
        temp_r31->parManId++;
#if VERSION_PAL
        temp_f31 = temp_r31->parManId - 8.5f;
#else
        temp_f31 = temp_r31->parManId - 10.2f;
#endif
        if (temp_f31 < 0.0f) {
            temp_r31->pos.x += (temp_r31->vel.x - temp_r31->pos.x) * 0.2f;
            temp_r31->pos.y += (temp_r31->vel.y - temp_r31->pos.y) * 0.15f;
            temp_r31->pos.z += (temp_r31->vel.z - temp_r31->pos.z) * 0.2f;
            temp_r31->scale += (temp_r31->accel.x - temp_r31->scale) * 0.2f;
            temp_r31->accel.y += (temp_r31->accel.z - temp_r31->accel.y) * 0.2f;
            temp_r31->color.a = temp_r31->accel.y;
        }
        else {
            temp_r31->pos.x += (temp_r31->speedDecay * 1.5f) * REFRESH_FREQ;
            temp_r31->pos.y += (temp_r31->colorIdx * 1.5f) * REFRESH_FREQ;
            temp_r31->pos.z += (temp_r31->scaleBase * 1.5f) * REFRESH_FREQ;
            temp_r31->scale += (temp_r31->accel.x * 0.01f);
            temp_r31->color.a = 0.92f * temp_r31->color.a;
        }
    }
    DCStoreRange(particle->data, particle->maxCnt * sizeof(HU3DPARTICLEDATA));
}

void fn_1_5DCC(s32 arg0, Vec *arg1, u32 arg2)
{
    float temp_f31;
    float temp_f30;

    HU3DPARTICLEDATA *temp_r31;
    HU3DPARTICLE *temp_r29;
    s32 temp_r28;
    temp_r29 = Hu3DData[arg0].hookData;
    if (temp_r29->dataCnt != 0) {
        temp_r31 = temp_r29->data;
        for (temp_r28 = 0; temp_r28 < temp_r29->maxCnt; temp_r28++, temp_r31++) {
            if (temp_r31->time) {
                continue;
            }
            temp_r31->time = 1;
            temp_r31->parManId = 0;
            temp_r31->pos.x = arg1->x;
            temp_r31->pos.y = 11990;
            temp_r31->pos.z = arg1->z;
            temp_f31 = frandmod(1000) * (1.0f / 1000.0f);
            temp_f30 = frandmod(1000) * (360.0f / 1000.0f);
            temp_r31->speedDecay = 10 * (0.8f * (temp_f31 * sind(temp_f30)));
            temp_r31->colorIdx = 10.0f * (5.0f * (1.0f - (temp_f31 * temp_f31)));
            temp_r31->scaleBase = 10 * (0.8f * (temp_f31 * cosd(temp_f30)));
            temp_r31->vel.x = temp_r31->speedDecay + arg1->x;
            temp_r31->vel.y = temp_r31->colorIdx + temp_r31->pos.y;
            temp_r31->vel.z = temp_r31->scaleBase + arg1->z;
            temp_r31->accel.x = (6.0f + (0.012f * frandmod(1000)));
            temp_r31->scale = 2.0f;
            temp_r31->accel.y = temp_r31->color.a = 10;
            temp_r31->accel.z = frandmod(100) + 64;
            temp_f31 = 0.00040000002f * frandmod(1000);
            temp_f31 += 0.6f * cosd(temp_f30);
            temp_r31->color.r = (55 * temp_f31) + 200;
            temp_r31->color.g = (50 * temp_f31) + 205;
            temp_r31->color.b = (5 * temp_f31) + 250;
            if (--arg2 == 0) {
                break;
            }
        }
    }
}

typedef struct work_61FC {
    s32 unk0;
    s32 unk4;
    u32 unk8;
    float unkC[2];
    s32 unk14;
    s32 unk18;
    s32 unk1C[7];
    float unk38[7];
    s16 unk54[7];
} Work61FC;

void fn_1_6540(omObjData *object);

void fn_1_61FC(omObjData *object)
{
    Work61FC *temp_r31;
    s32 temp_r30;
    s32 temp_r28;
    s32 temp_r26;

    Work61FC *temp_r27;

    float sp8[][2] = { 96, 64, 486, 64, 96, 416, 486, 416 };
    float sp28[][2] = { 0, 0, 0, 0, -54, -1, 2, 1, -20, 0, 42, 2, 22, 2 };

    object->stat |= 0x100;
    object->data = HuMemDirectMallocNum(HEAP_SYSTEM, 4 * sizeof(Work61FC), MEMORY_DEFAULT_NUM);
    temp_r27 = object->data;
    memset(temp_r27, 0, 4 * sizeof(Work61FC));
    temp_r31 = temp_r27;
    for (temp_r28 = 0; temp_r28 < 4; temp_r28++, temp_r31++) {
        for (temp_r30 = 0; temp_r30 < 7; temp_r30++) {
            temp_r31->unk54[temp_r30] = -1;
            temp_r31->unk38[temp_r30] = 1;
        }
        temp_r31->unkC[0] = sp8[temp_r28][0];
        temp_r31->unkC[1] = sp8[temp_r28][1];
        temp_r26 = espEntry(DATA_MAKE_NUM(DATADIR_MGCONST, 0x29), 4, 0);
        temp_r31->unk54[0] = temp_r26;
        espColorSet(temp_r26, 0, 0, 0);
        espTPLvlSet(temp_r26, 0.5);
        temp_r31->unk54[1] = espEntry(DATA_MAKE_NUM(DATADIR_MGCONST, 0x28), 3, 0);
        temp_r31->unk54[2] = espEntry(lbl_1_data_0[GWPlayerCfg[temp_r28].character], 2, 0);
        temp_r31->unk54[3] = espEntry(DATA_MAKE_NUM(DATADIR_M408, 0x2B), 2, 0);
        temp_r31->unk54[4] = espEntry(DATA_MAKE_NUM(DATADIR_MGCONST, 0x08), 2, 0);
        temp_r31->unk54[6] = espEntry(DATA_MAKE_NUM(DATADIR_MGCONST, 0x33), 2, 0);
        temp_r31->unk54[5] = espEntry(DATA_MAKE_NUM(DATADIR_MGCONST, 0x33), 2, 0);
        for (temp_r30 = 0; temp_r30 < 7; temp_r30++) {
            if (temp_r31->unk54[temp_r30] >= 0) {
                espPosSet(temp_r31->unk54[temp_r30], temp_r31->unkC[0] + sp28[temp_r30][0], temp_r31->unkC[1] + sp28[temp_r30][1]);
                espDispOff(temp_r31->unk54[temp_r30]);
            }
        }
        temp_r31->unk0 = 0;
    }
    HuDataDirClose(DATADIR_MGCONST);
    object->func = fn_1_6540;
    (void)temp_r27;
    (void)temp_r27;
}

void fn_1_6540(omObjData *object)
{
    float temp_f31;
    Work61FC *temp_r31;
    s32 temp_r30;
    s32 temp_r29;
    Work61FC *temp_r28 = object->data;
    temp_r31 = temp_r28;
    for (temp_r29 = 0; temp_r29 < 4; temp_r29++, temp_r31++) {
        switch (temp_r31->unk14) {
            case 0:
                if (fn_1_6878() == 3) {
                    temp_r31->unk14 = 1;
                }
                break;

            case 1:
                temp_r31->unk18 = 0;
                temp_r31->unk1C[5] = temp_r31->unk8 % 10;
                temp_r31->unk1C[6] = (temp_r31->unk8 / 10) % 10;
                for (temp_r30 = 0; temp_r30 < 7; temp_r30++) {
                    if (temp_r31->unk54[temp_r30] >= 0) {
                        espDispOn(temp_r31->unk54[temp_r30]);
                    }
                }
                if (temp_r31->unk0) {
                    temp_r31->unk38[5] = temp_r31->unk38[6] = 0.5f;
                    temp_r31->unk14++;
                }
                else {
                    temp_r31->unk0 = 1;
                    temp_r31->unk38[5] = temp_r31->unk38[6] = 1.0f;
                    temp_r31->unk14 += 3;
                    break;
                }

